Revit 2027 API
VertexFormat.IsValid Method
 Tests whether the vertex format specification is valid for rendering.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if the vertex format specification is valid for rendering, false otherwise.
Remarks
 The vertex format specifications are internally associated with low-level graphics state and may become invalidated when the state changes. Therefore, an application should test each vertex format object for validity before using it when submitting geometry. If the vertex format object becomes invalid, the application should re-create it.
See Also
Reference
VertexFormat Class
Autodesk.Revit.DB.DirectContext3D Namespace